/* Объектно-ориентированное программирование. Создать класс Student с
модификатором доступа public. В данном классе создать метод, в котором добавляем поля с
модификатором доступа private, с их последующим вводом с клавиатуры: Количество студентов, данные
о которых вводим с клавиатуры; ID студента; Направление подготовки студента; ФИО студента; Группа
студента. Далее создать два класса-наследника, в которых мы переопределяем данный метод супер-
класса. Необходимо реализовать полиморфный вывод данного метода. Минимальное количество
студентов 5. На выходе мы должны получить список студентов в табличном виде (с заголовками столбцов)

Реализовать программу с интерактивным консольным меню.
Каждый пункт меню должен быть отдельным классом-наследником (подклассом).
1. Вывести все таблицы из базы данных MySQL.
2. Создать таблицу в базе данных MySQL.
3. Ввести данные о всех студентах и сохранить их в MySQL с последующим табличным
(форматированным) выводом в консоль.
4. Вывести данные о студенте по ID из MySQL.
5. Удалить данные о студенте из MySQL по ID.
6. Сохранить итоговые результаты из MySQL в Excel и вывести их в консоль. */


public class hard_10 {
}
